Public Member Functions | Friends | List of all members
ACAPI::Library::LibraryTreePath Class Referencefinal
Library Management
Library tree location (E.g. folder, Library Part) More...
#include <LibraryTreePath.hpp>
 Inheritance diagram for ACAPI::Library::LibraryTreePath:
 Public Member Functions
bool  | IsRoot () const
Root path of the library tree.
GS::UniString  | GetLastPart () const
The name of the current node.
LibraryTreePath  | GetParent () const
The parent of the represented node.
std::vector< GS::UniString >  | GetParts () const
The parts of the path.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | Impl::LibraryManagerImpl
 class  | Impl::LibraryTreePathImpl
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Library tree location (E.g. folder, Library Part)
Since
Archicad 28